# find - шукає в тексті, повертає індекс першого входження або -1

row = ('Метод .find() використовується для пошуку підстрічки в рядку і повертає індекс '
       'першого входження знайденої підстрічки. Якщо підстрічка не знайдена, повертається -1.')

# print(row.find('f'))  # 7
# print(row[7])
#
# print(row.find('для'))  # 31
# print(row[31])
#
# print(row.find('о', 4))  # пошук з 4го індекса включно
# print(row[17: 31])
#
# print(row.find('asd'))  # -1

# print(row.index('f'))  # як і find порене індекс першого входження, але якщо нема, то буде помилка
# print(row.index('для'))
# # print(row.index('фів'))  # буде помилка
#
#
#
# print(row.find('о', 4, 18))  # пошук з 4го індекса включно по 18 невключно

